1cExtension/Catalogs/ОбменДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ОбменДанными</Name>
			<Comment>Обмен данными</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСообщения</Name>
					<Comment>Вид сообщения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбменДаннымиВидыСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Comment>Дата завершения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Comment>Отправитель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбменДаннымиКлиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Comment>Получатель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбменДаннымиКлиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбменДаннымиПользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелоСообщения</Name>
					<Comment>Тело сообщения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелоОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСообщения</Name>
					<Comment>Тип сообщения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ОбменДаннымиТипыСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БПОснование</Name>
					<Comment>Бизнеспроцесс основание</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьОшибка</Name>
					<Comment>Есть ошибка</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Comment>Ошибка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбменДаннымиТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Comment>Дата завершения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСвязи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХэшТелаЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Comment>Объект</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1cExtension/Enums/ОбменДаннымиТочкиМаршрута.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ОбменДаннымиТочкиМаршрута</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеСообщения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработкаСообщения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1cExtension/Catalogs/ОбменДанными/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПосмотретьТелоЗапросаНаСервере()
	Тд.Очистить();
	Тд.УстановитьТекст(Объект.ТелоСообщения);
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьТелоЗапроса(Команда)
	ПосмотретьТелоЗапросаНаСервере(); 
КонецПроцедуры

&НаСервере
Процедура ПосмотретьТелоОтветаНаСервере()
	Тд.Очистить();
	Тд.УстановитьТекст(Объект.ТелоОтвета);
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьТелоОтвета(Команда)
	ПосмотретьТелоОтветаНаСервере();
	
КонецПроцедуры


&НаСервере
Процедура ПриОткрытииНаСервере()
	
	// ГУИД = 05dbe824-a4c6-11dd-bf56-00145e3710ab  
	
	// Ссылка будет установлена в переменную СсылкаНаОбъектГуид
	Попытка
		НачатьТранзакцию();
		УИД = Новый УникальныйИдентификатор(Объект.Объект);
		
		// все объекты по которым можно получить ссылку
		СсылкаНаОбъект = Неопределено;
		
		Если ПолучитьСсылкуНоМенеджеруОбъекта(Справочники,УИД,СсылкаНаОбъект) Тогда
			
		ИначеЕсли ПолучитьСсылкуНоМенеджеруОбъекта(Документы,УИД,СсылкаНаОбъект) Тогда
			
		ИначеЕсли ПолучитьСсылкуНоМенеджеруОбъекта(ПланыВидовХарактеристик,УИД,СсылкаНаОбъект) Тогда
			
		ИначеЕсли ПолучитьСсылкуНоМенеджеруОбъекта(ПланыСчетов,УИД,СсылкаНаОбъект) Тогда
			
		ИначеЕсли ПолучитьСсылкуНоМенеджеруОбъекта(ПланыОбмена,УИД,СсылкаНаОбъект) Тогда
			
		ИначеЕсли ПолучитьСсылкуНоМенеджеруОбъекта(БизнесПроцессы,УИД,СсылкаНаОбъект) Тогда
			
		ИначеЕсли ПолучитьСсылкуНоМенеджеруОбъекта(Задачи,УИД,СсылкаНаОбъект) Тогда
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Ошибка=ОписаниеОшибки();
	КонецПопытки;
	
	
	ЭтаФорма.СсылкиНаОбъекты.Очистить();
	Для каждого СтрокаО Из Объект.Объекты Цикл
		Попытка
			НачатьТранзакцию();
			УИД = Новый УникальныйИдентификатор(СтрокаО.Объект);
			
			// все объекты по которым можно получить ссылку
			СсылкаНаОбъект1 = Неопределено;
			
			Если ПолучитьСсылкуНоМенеджеруОбъекта(Справочники,УИД,СсылкаНаОбъект1) Тогда
				
			ИначеЕсли ПолучитьСсылкуНоМенеджеруОбъекта(Документы,УИД,СсылкаНаОбъект1) Тогда
				
			ИначеЕсли ПолучитьСсылкуНоМенеджеруОбъекта(ПланыВидовХарактеристик,УИД,СсылкаНаОбъект1) Тогда
				
			ИначеЕсли ПолучитьСсылкуНоМенеджеруОбъекта(ПланыСчетов,УИД,СсылкаНаОбъект1) Тогда
				
			ИначеЕсли ПолучитьСсылкуНоМенеджеруОбъекта(ПланыОбмена,УИД,СсылкаНаОбъект1) Тогда
				
			ИначеЕсли ПолучитьСсылкуНоМенеджеруОбъекта(БизнесПроцессы,УИД,СсылкаНаОбъект1) Тогда
				
			ИначеЕсли ПолучитьСсылкуНоМенеджеруОбъекта(Задачи,УИД,СсылкаНаОбъект1) Тогда
				
			КонецЕсли;
			
			СтрокаОбъект = ЭтаФорма.СсылкиНаОбъекты.Добавить();
			СтрокаОбъект.СсылкаНаОбъект = СсылкаНаОбъект1;
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			Ошибка=ОписаниеОшибки();
		КонецПопытки;
		
		
	КонецЦикла;
	
	
	
	Попытка
		НачатьТранзакцию();
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ЭтаФорма.Объект.ТелоСообщения);
		НашиДанныеJSON = ПрочитатьJSON(ЧтениеJSON,Истина);
		НашиДанныеJSON =  ргОбменДаннымиОбработкаВходящиеСервер.ПолучитьСтруктуруИзСоответствия(НашиДанныеJSON); 
		ЧтениеJSON.Закрыть();
		
		ДеревоЗначений= новый ДеревоЗначений;
		ДеревоЗначений.Колонки.Добавить("Ключ");
		ДеревоЗначений.Колонки.Добавить("Значение");
		ВерхнийУровеньдерева=ДеревоЗначений.Строки.Добавить();
		ВерхнийУровеньдерева.Ключ="Структура JSON";    
		СформироватьДерево(НашиДанныеJSON,ВерхнийУровеньдерева);
		
		ЗначениеВДанныеФормы(ДеревоЗначений, Дерево);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Ошибка=ОписаниеОшибки();
	КонецПопытки;
	
	// ПолучитьСсылкуНоМенеджеруОбъекта()
КонецПроцедуры



&НаСервере
Функция СформироватьДерево(НашаСтруктура,ТекущееДерево)
	
	Для каждого СтрокаСтруктуры из НашаСтруктура цикл	
		Если ТипЗнч(СтрокаСтруктуры)=Тип("КлючИЗначение") тогда
			ПодчиненнаяСтрока=ТекущееДерево.Строки.Добавить();
			ПодчиненнаяСтрока.Ключ=СтрокаСтруктуры.Ключ;	
			
			Если ТипЗнч(СтрокаСтруктуры.Значение)=Тип("Структура") или ТипЗнч(СтрокаСтруктуры.Значение)=Тип("Соответствие") или ТипЗнч(СтрокаСтруктуры.Значение)=Тип("Массив")  тогда			
				СформироватьДерево(СтрокаСтруктуры.Значение,ПодчиненнаяСтрока)
			Иначе
				ПодчиненнаяСтрока.Значение=СтрокаСтруктуры.Значение;          
			КонецЕсли;
		ИначеЕсли ТипЗнч(СтрокаСтруктуры)=Тип("Структура") или ТипЗнч(СтрокаСтруктуры)=Тип("Соответствие") или ТипЗнч(СтрокаСтруктуры)=Тип("Массив")  тогда	
			ПодчиненнаяСтрока=ТекущееДерево.Строки.Добавить();
			ПодчиненнаяСтрока.Ключ="";
			ПодчиненнаяСтрока.Значение="[...]";
			СформироватьДерево(СтрокаСтруктуры,ПодчиненнаяСтрока);
		Иначе
			ПодчиненнаяСтрока=ТекущееДерево.Строки.Добавить();
			ПодчиненнаяСтрока.Значение=СтрокаСтруктуры;	   
		КонецЕсли;
	КонецЦикла;
	
КонецФункции


&НаСервереБезКонтекста
Функция ПолучитьСсылкуНоМенеджеруОбъекта(ОбъектыМенеджер,УникальныйИдентификатор,Ссылка = Неопределено)
	Ссылка = Неопределено;
	Для Каждого Менеджер Из ОбъектыМенеджер Цикл
		
		СсылкаНаОбъектГуид = Менеджер.ПолучитьСсылку(УникальныйИдентификатор);
		
		Если СсылкаНаОбъектГуид.ПолучитьОбъект() <> Неопределено Тогда
			Ссылка = СсылкаНаОбъектГуид;
			Возврат Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	
	
	Возврат Ложь;
	
КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПерезапуститьНаСервере()
	ЭтаФорма.Объект.Ошибка = "";	// Вставить содержимое обработчика.
	ЭтаФорма.Объект.ТочкаМаршрута = Перечисления.ОбменДаннымиТочкиМаршрута.Новое;	// Вставить содержимое обработчика.
	ЭтаФорма.Объект.ЕстьОшибка = Ложь;	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Перезапустить(Команда)
	ПерезапуститьНаСервере();
КонецПроцедуры
